### **Analysis** with titanic data

In [59]:
import pandas as pd

In [60]:
df=pd.read_csv("e:/dataset/analysis/titanic.csv")
df

,PassengerId,Survived,Pclass,Name,gender,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [61]:
#df.describe()         #ye dataframe ka summary deta hai.
df.describe(include='all')

,PassengerId,Survived,Pclass,Name,gender,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
count,891.000000,891.000000,891.000000,891,891,714.000000,891.000000,891.000000,891,891.000000,204,889
unique,NaN,NaN,NaN,891,2,NaN,NaN,NaN,681,NaN,147,3
top,NaN,NaN,NaN,"Braund, Mr. Owen Harris",male,NaN,NaN,NaN,347082,NaN,B96 B98,S
freq,NaN,NaN,NaN,1,577,NaN,NaN,NaN,7,NaN,4,644
mean,446.000000,0.383838,2.308642,NaN,NaN,29.699118,0.523008,0.381594,NaN,32.204208,NaN,NaN
std,257.353842,0.486592,0.836071,NaN,NaN,14.526497,1.102743,0.806057,NaN,49.693429,NaN,NaN
min,1.000000,0.000000,1.000000,NaN,NaN,0.420000,0.000000,0.000000,NaN,0.000000,NaN,NaN
25%,223.500000,0.000000,2.000000,NaN,NaN,20.125000,0.000000,0.000000,NaN,7.910400,NaN,NaN
50%,446.000000,0.000000,3.000000,NaN,NaN,28.000000,0.000000,0.000000,NaN,14.454200,NaN,NaN
75%,668.500000,1.000000,3.000000,NaN,NaN,38.000000,1.000000,0.000000,NaN,31.000000,NaN,NaN
max,891.000000,1.000000,3.000000,NaN,NaN,80.000000,8.000000,6.000000,NaN,512.329200,NaN,NaN

In [62]:
#df.Survived.unique()
#df.Survived.value     #value method
df.Survived.value_counts()

0    549
1    342
Name: Survived, dtype: int64

In [63]:
549/891*100

61.61616161616161

In [64]:
342/891*100

38.38383838383838

In [65]:
df.Pclass.value_counts()

3    491
1    216
2    184
Name: Pclass, dtype: int64

In [66]:
491+216+184

891

In [67]:
df.gender.value_counts()

male      577
female    314
Name: gender, dtype: int64

In [68]:
577+314

891

In [69]:
df.pivot_table(index=["Survived"],values="gender",columns="Pclass",aggfunc="count")

Pclass      1   2    3
Survived
0          80  97  372
1         136  87  119

In [70]:
df.pivot_table(index=["Survived","gender"],values="Pclass",aggfunc="count")

                 Pclass
Survived gender
0        female      81
         male       468
1        female     233
         male       109

In [71]:
df.pivot_table(index=["Survived","Pclass"],columns="gender",aggfunc="count")

                   Age       Cabin      Embarked        Fare        Name       \
gender          female male female male   female male female male female male
Survived Pclass
0        1           3   61      3   56        3   77      3   77      3   77
         2           6   84      1    2        6   91      6   91      6   91
         3          55  215      2    4       72  300     72  300     72  300
1        1          82   40     78   39       89   45     91   45     91   45
         2          68   15      9    4       70   17     70   17     70   17
         3          47   38      4    2       72   47     72   47     72   47

                 Parch      PassengerId       SibSp      Ticket
gender          female male      female male female male female male
Survived Pclass
0        1           3   77           3   77      3   77      3   77
         2           6   91           6   91      6   91      6   91
         3          72  300          72  300     72  300     72  300
1        1          91   45          91   45     91   45     91   45
         2          70   17          70   17     70   17     70   17
         3          72   47          72   47     72   47     72   47

In [72]:
df.pivot_table(index=["Survived","Pclass"],values="gender",aggfunc="count")

                 gender
Survived Pclass
0        1           80
         2           97
         3          372
1        1          136
         2           87
         3          119

In [73]:
df[(df.Survived==1) & (df.Pclass==1)].shape

(136, 12)

In [74]:
df[(df.Survived==0) & (df.Pclass==1)].shape

(80, 12)

In [75]:
df[(df.Survived==1) & (df.Pclass==2)].shape

(87, 12)

In [76]:
df[(df.Survived==0) & (df.Pclass==2)].shape

(97, 12)

In [77]:
df.gender.value_counts()

male      577
female    314
Name: gender, dtype: int64

In [81]:
df.pivot_table(index=["Survived","gender"],values="Pclass",aggfunc="count")

                 Pclass
Survived gender
0        female      81
         male       468
1        female     233
         male       109

In [78]:
df[(df.Survived==1) & (df.gender=='male')].shape

(109, 12)

In [82]:
df[(df.Survived==1) & (df.gender=='female')].shape

(233, 12)

In [83]:
df[(df.Survived==0) & (df.gender=="male")].shape

(468, 12)

In [84]:
df[(df.Survived==0) & (df.gender=="female")].shape

(81, 12)

In [100]:
df.pivot_table(index=["Survived","gender"],values="Age",columns="Pclass",aggfunc="count")

Pclass            1   2    3
Survived gender
0        female   3   6   55
         male    61  84  215
1        female  82  68   47
         male    40  15   38

In [115]:
df.Age.value_counts()

24.00    30
22.00    27
18.00    26
19.00    25
28.00    25
         ..
36.50     1
55.50     1
0.92      1
23.50     1
74.00     1
Name: Age, Length: 88, dtype: int64

- **isnull method**/ **notnull**----**(~)**--notnull
- ye True/False ke jariye hume result batata hai.
- False----value hai.
- True-----value missing hai.

In [118]:
df.Age.isnull()

0      False
1      False
2      False
3      False
4      False
       ...
886    False
887    False
888     True
889    False
890    False
Name: Age, Length: 891, dtype: bool

In [120]:
df.Survived.isnull().sum()

0

In [121]:
df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
gender           0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [128]:
#inke age given nhi hai.
df[df.Age.isnull()].shape

(177, 12)

In [129]:
#inke age given hai.
df[~ df.Age.isnull()].shape

(714, 12)

In [130]:
df[df.Age.notnull()].shape

(714, 12)

In [119]:
df.Age.isnull().sum()

177

In [94]:
#0 se 10 saal ki age wale ka data
df[(df.Age>=0) & (df.Age<=10)].shape

(64, 12)

In [95]:
df[(df.Age>=0) & (df.Age<=10) & (df.Survived==1)].shape

(38, 12)

In [96]:
df[(df.Age>=0) & (df.Age<=10) & (df.Survived==0)].shape

(26, 12)

In [97]:
#old age wale ka data 60 se 80
df[(df.Age>=60)].shape

(26, 12)

In [98]:
df[(df.Age>=60) & (df.Survived==1)].shape

(7, 12)

In [99]:
df[(df.Age>=60) & (df.Survived==0)].shape

(19, 12)

In [101]:
#60 se upper wale kitne survived ke gaye ---female
df[(df.Age>=60) & (df.Survived==1) & (df.gender=="female")].shape

(4, 12)

In [102]:
df[(df.Age>=60) & (df.Survived==1) & (df.gender=="male")].shape

(3, 12)

In [103]:
#60 se upper wale kitne survived nhi kiya ke ---female
df[(df.Age>=60) & (df.Survived==0) & (df.gender=="female")].shape

(0, 12)

In [104]:
df[(df.Age>=60) & (df.Survived==0) & (df.gender=="male")].shape

(19, 12)

In [110]:
df[(df.Age>=60) & (df.Survived==1) & (df.Pclass==1)].shape

(5, 12)

In [109]:
df[(df.Age>=60) & (df.Survived==1) & (df.Pclass==2)].shape

(1, 12)

In [112]:
df[(df.SibSp==0) & (df.Parch==0)].shape

(537, 12)

In [113]:
df[(df.SibSp==0) & (df.Parch==0) & (df.Survived==1)].shape

(163, 12)

In [114]:
df[(df.SibSp==0) & (df.Parch==0) & (df.Survived==0)].shape

(374, 12)